app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "sdasads"], ["created_at", Mon, 17 Jul 2017 20:41:51 UTC +00:00], ["title", "daa"], ["updated_at", Mon, 17 Jul 2017 20:41:51 UTC +00:00]]
---
  def create
    #raise params[:post].inspect
    @post = Post.new(params[:post])
    if internet_connection?
      respond_to do |format|
        if @post.save